Ribster/STM32-Projects/stm32lib for STM32F0/ECS0002 - STM32F051 stm32lib/src/nRF24L01p.cpp
/*
* ----------------------------------------------------------------------------
* “THE COFFEEWARE LICENSE” (Revision 1):
* <ihsan@kehribar.me> wrote this file. As long as you retain this notice you
* can do whatever you want with this stuff. If we meet some day, and you think
* this stuff is worth it, you can buy me a coffee in return.
* -----------------------------------------------------------------------------
* This library is based on this library:
*   https://github.com/aaronds/arduino-nrf24l01
* Which is based on this library:
*   http://www.tinkerer.eu/AVRLib/nRF24L01
* -----------------------------------------------------------------------------
*/
#include "nRF24L01p.h"

namespace stm32lib {


nRF24L01p::nRF24L01p(nRF24L01p_t* nRFStructure, SPI_t* SPIStruct, SPI* SPIObject, IO* IOObject){
	setNRF(nRFStructure);
	setSPI(SPIStruct, SPIObject);
	setIO(IOObject);
}
nRF24L01p::~nRF24L01p(){

}

void nRF24L01p::setNRF(nRF24L01p_t* nRFStructure){
	nRFObj = nRFStructure;
}

void nRF24L01p::setSPI(SPI_t* SPIstructure, SPI* SPIobject){
	nRFObj->SPIStruct = SPIstructure;
	nRFObj->SPIObject = SPIobject;
}

void nRF24L01p::setIO(IO* IOObject){
	nRFObj->IOObject = IOObject;
}
void nRF24L01p::setCE(IO_t* pin){
	nRFObj->pin_CE = pin;
}
void nRF24L01p::setIRQ(IO_t* pin){
	nRFObj->pin_IRQ = pin;
}
void nRF24L01p::setLED(IO_t* pin){
	nRFObj->pin_LED = pin;
}

void nRF24L01p::begin(void){
	begin(nRFObj->pin_CE, nRFObj->pin_IRQ, nRFObj->pin_LED);
}

void nRF24L01p::begin(IO_t* pin_CE, IO_t* pin_IRQ, IO_t* pin_LED){
	if(nRFObj->SPIStruct->initDone == false){
		printf("error on nRF init SPI");
		return;
	}
	if (pin_CE->init == false || pin_IRQ->init == false || pin_LED->init == false){
		printf("error on nRF init pins");
		return;
	}
	nRFObj->pin_CE = pin_CE;
	nRFObj->pin_IRQ = pin_IRQ;
	nRFObj->pin_LED = pin_LED;
	setSS(true);
	setCE(false);
}
void nRF24L01p::init(void){
	init(nRFObj->channel, nRFObj->payloadSize, nRFObj->dataRate, nRFObj->outputPower);
}

void nRF24L01p::init(uint8_t channel, uint8_t payload, nRF24L01p_DataRate_t datarate, nRF24L01p_OutputPower_t outputPower){
    nRFObj->channel = channel;
    nRFObj->payloadSize = payload;
    nRFObj->dataRate = datarate;
    nRFObj->outputPower = outputPower;

    // Set RF Channel
    setRFChannel(channel);
    printf("rf channel set to: %d \r\n", getRFChannel());

    setRegister(nRF24L01p_Registers_Config, nRF24L01p_RegisterBits_Config_Preset);

    // Length of incoming payload
    setPayloadSize(0x00, 0);
    printf("plsize channel 0 set to: %d \r\n", getPayloadSize(0));
    setPayloadSize(payload, 1);
    printf("plsize channel 1 set to: %d \r\n", getPayloadSize(1));
    setPayloadSize(0x00, 2);
    printf("plsize channel 2 set to: %d \r\n", getPayloadSize(2));
    setPayloadSize(0x00, 3);
    printf("plsize channel 3 set to: %d \r\n", getPayloadSize(3));
    setPayloadSize(0x00, 4);
    printf("plsize channel 4 set to: %d \r\n", getPayloadSize(4));
    setPayloadSize(0x00, 5);
    printf("plsize channel 5 set to: %d \r\n", getPayloadSize(5));

    // datarate set && gain set
    setDataRate(datarate);
    printf("datarate set to: %d \r\n", getDataRate());
    setOutputPower(outputPower);
    printf("outputpower set to: %d \r\n", getOutputPower());

    // CRC enable, 1 byte CRC length
    setCRCLength(1);
    printf("crc set to: %d \r\n", getCRCLength());

    // feature
    setRegister(nRF24L01p_Registers_FEATURE, 0x01);


    // auto acknowledgement
    setRegister(nRF24L01p_Registers_EN_AA, 0x00);

    // Enable RX addresses
    setRegister(nRF24L01p_Registers_EN_RXAddr, 0x03);


    setRegister(nRF24L01p_Registers_Setup_Retr, 0x00);


    setRegister(nRF24L01p_Registers_DYNPD, 0x00);

    // start listening
    setPowerUpRX();

}

void nRF24L01p::setRFChannel(uint8_t newVal){
	setRegister(nRF24L01p_Registers_RF_CH, newVal);
}
uint8_t nRF24L01p::getRFChannel(void){
	return getRegister(nRF24L01p_Registers_RF_CH);
}

void nRF24L01p::setPayloadSize(uint8_t size, uint8_t pipe){
	uint8_t checkSize = size;

	if(checkSize > 32){
		checkSize = 32;

	}

	setAllocBuffer(checkSize);

	switch (pipe){
		case 0x00:
			setRegister(nRF24L01p_Registers_RX_PW_P0, checkSize);
			break;
		case 0x01:
			setRegister(nRF24L01p_Registers_RX_PW_P1, checkSize);
			break;
		case 0x02:
			setRegister(nRF24L01p_Registers_RX_PW_P2, checkSize);
			break;
		case 0x03:
			setRegister(nRF24L01p_Registers_RX_PW_P3, checkSize);
			break;
		case 0x04:
			setRegister(nRF24L01p_Registers_RX_PW_P4, checkSize);
			break;
		case 0x05:
			setRegister(nRF24L01p_Registers_RX_PW_P5, checkSize);
			break;
	}
}
void nRF24L01p::setPayloadSize(uint8_t size){
	setPayloadSize(0x00, 0); // for RX ack
	setPayloadSize(size, 1); // pipe one
}
uint8_t nRF24L01p::getPayloadSize(uint8_t pipe){
	switch (pipe){
		case 0x00:
			return getRegister(nRF24L01p_Registers_RX_PW_P0);
			break;
		case 0x01:
			return getRegister(nRF24L01p_Registers_RX_PW_P1);
			break;
		case 0x02:
			return getRegister(nRF24L01p_Registers_RX_PW_P2);
			break;
		case 0x03:
			return getRegister(nRF24L01p_Registers_RX_PW_P3);
			break;
		case 0x04:
			return getRegister(nRF24L01p_Registers_RX_PW_P4);
			break;
		case 0x05:
			return getRegister(nRF24L01p_Registers_RX_PW_P5);
			break;
	}
	return 0x00;
}
uint8_t nRF24L01p::getPayloadSize(void){
	return getPayloadSize(1);
}

void nRF24L01p::setOutputPower(nRF24L01p_OutputPower_t newVal){
	uint8_t tmp = getRegister(nRF24L01p_Registers_RF_Setup);
	tmp &= ~(0x3<<nRF24L01p_RegisterBits_RF_PWR);
	tmp |= (newVal << nRF24L01p_RegisterBits_RF_PWR);
	setRegister(nRF24L01p_Registers_RF_Setup, tmp);
	nRFObj->outputPower = newVal;
}
nRF24L01p_OutputPower_t nRF24L01p::getOutputPower(void){
	uint8_t tmp = (getRegister(nRF24L01p_Registers_RF_Setup) & (0x3<<nRF24L01p_RegisterBits_RF_PWR))>>nRF24L01p_RegisterBits_RF_PWR;
	switch (tmp){
	case nRF24L01p_OutputPower_M18dBm:
	case nRF24L01p_OutputPower_M12dBm:
	case nRF24L01p_OutputPower_M6dBm:
	case nRF24L01p_OutputPower_0dBm:
		return (nRF24L01p_OutputPower_t)tmp;
		break;
	}
	return nRF24L01p_OutputPower_M18dBm;
}

void nRF24L01p::setDataRate(nRF24L01p_DataRate_t newVal){
	uint8_t tmp = getRegister(nRF24L01p_Registers_RF_Setup);
	tmp &= ~(1<<nRF24L01p_RegisterBits_RF_DR_LOW | 1<<nRF24L01p_RegisterBits_RF_DR_HIGH);
	tmp |= (newVal<<nRF24L01p_RegisterBits_RF_DR_HIGH);
	setRegister(nRF24L01p_Registers_RF_Setup, tmp);
	nRFObj->dataRate = newVal;
}
nRF24L01p_DataRate_t nRF24L01p::getDataRate(void){
	uint8_t tmp = ( getRegister(nRF24L01p_Registers_RF_Setup) & (1<<nRF24L01p_RegisterBits_RF_DR_LOW | 1<<nRF24L01p_RegisterBits_RF_DR_HIGH) ) >> nRF24L01p_RegisterBits_RF_DR_HIGH;
	switch (tmp){
		case nRF24L01p_DataRate_1M:
		case nRF24L01p_DataRate_2M:
		case nRF24L01p_DataRate_250k:
			return (nRF24L01p_DataRate_t)tmp;
			break;
	}
	return (nRF24L01p_DataRate_Reserved);
}

