Ribster/STM32-Projects/stm32lib for STM32F0/ECS0002 - STM32F051 stm32lib/src/nRF24L01p.cpp
void nRF24L01p::setCRCLength(uint8_t newVal){
	uint8_t tmp = getRegister(nRF24L01p_Registers_Config);
	tmp &= ~(1<<nRF24L01p_RegisterBits_Config_EN_CRC | 1<<nRF24L01p_RegisterBits_Config_CRCO);
	switch (newVal){
	case 0x01:
		// enable CRC set to 1
		tmp |= (1<<nRF24L01p_RegisterBits_Config_EN_CRC | 0<<nRF24L01p_RegisterBits_Config_CRCO);
		break;
	case 0x02:
		// enable CRC set to 2
		tmp |= (1<<nRF24L01p_RegisterBits_Config_EN_CRC | 1<<nRF24L01p_RegisterBits_Config_CRCO);
		break;
	}
	setRegister(nRF24L01p_Registers_Config, tmp);
	nRFObj->crclength = newVal;
}
uint8_t nRF24L01p::getCRCLength(void){
	uint8_t tmp = getRegister(nRF24L01p_Registers_Config);
	if(tmp & 1<<nRF24L01p_RegisterBits_Config_EN_CRC){
		if(tmp & 1<<nRF24L01p_RegisterBits_Config_CRCO){
			return 2;
		} else {
			return 1;
		}
	}
	return 0;
}

void nRF24L01p::setAutoAcknowledgement(bool newVal){
	setAutoAcknowledgement(1, newVal);
}

void nRF24L01p::setAutoAcknowledgement(uint8_t pipe, bool newVal){
	switch (pipe){
		case 0x00:
			setRegisterBit(nRF24L01p_Registers_EN_AA, nRF24L01p_RegisterBits_ENAA_P0, newVal);
			break;
		case 0x01:
			setRegisterBit(nRF24L01p_Registers_EN_AA, nRF24L01p_RegisterBits_ENAA_P1, newVal);
			break;
		case 0x02:
			setRegisterBit(nRF24L01p_Registers_EN_AA, nRF24L01p_RegisterBits_ENAA_P2, newVal);
			break;
		case 0x03:
			setRegisterBit(nRF24L01p_Registers_EN_AA, nRF24L01p_RegisterBits_ENAA_P3, newVal);
			break;
		case 0x04:
			setRegisterBit(nRF24L01p_Registers_EN_AA, nRF24L01p_RegisterBits_ENAA_P4, newVal);
			break;
		case 0x05:
			setRegisterBit(nRF24L01p_Registers_EN_AA, nRF24L01p_RegisterBits_ENAA_P5, newVal);
			break;
	}
}
bool nRF24L01p::getAutoAcknowledgement(void){
	return getAutoAcknowledgement(1);
}
bool nRF24L01p::getAutoAcknowledgement(uint8_t pipe){
	switch (pipe){
		case 0x00:
			return getRegisterBit(nRF24L01p_Registers_EN_AA, nRF24L01p_RegisterBits_ENAA_P0);
			break;
		case 0x01:
			return getRegisterBit(nRF24L01p_Registers_EN_AA, nRF24L01p_RegisterBits_ENAA_P1);
			break;
		case 0x02:
			return getRegisterBit(nRF24L01p_Registers_EN_AA, nRF24L01p_RegisterBits_ENAA_P2);
			break;
		case 0x03:
			return getRegisterBit(nRF24L01p_Registers_EN_AA, nRF24L01p_RegisterBits_ENAA_P3);
			break;
		case 0x04:
			return getRegisterBit(nRF24L01p_Registers_EN_AA, nRF24L01p_RegisterBits_ENAA_P4);
			break;
		case 0x05:
			return getRegisterBit(nRF24L01p_Registers_EN_AA, nRF24L01p_RegisterBits_ENAA_P5);
			break;
	}
	return false;
}

void nRF24L01p::setRetransmissionDelay(uint16_t delayVal){
	uint8_t tmp = getRegister(nRF24L01p_Registers_Setup_Retr) & 0x0F;
	uint8_t times = (delayVal / 250);
	if( !(times%250) ){
		times --;
	}
	setRegister(nRF24L01p_Registers_Setup_Retr, tmp | (times << nRF24L01p_RegisterBits_ARD));
}
uint16_t nRF24L01p::getRetransmissionDelay(void){
	uint8_t tmp = getRegister(nRF24L01p_Registers_Setup_Retr) & 0xF0;
	return ( (tmp >> nRF24L01p_RegisterBits_ARD) + 1) * 250;
}

void nRF24L01p::setRetransmissionAttempts(uint8_t newVal){
	uint8_t tmp = getRegister(nRF24L01p_Registers_Setup_Retr) & 0xF0;
	if(newVal < 0x10){
		setRegister(nRF24L01p_Registers_Setup_Retr, tmp | newVal);
	} else {
		setRegister(nRF24L01p_Registers_Setup_Retr, tmp | 0x0F);
	}
}
uint8_t nRF24L01p::getRetransmissionAttempts(void){
	uint8_t tmp = getRegister(nRF24L01p_Registers_Setup_Retr) & 0x0F;
	return tmp;
}

void nRF24L01p::setDynamicPayloadLength(bool newVal){
	setDynamicPayloadLength(1, newVal);
}
void nRF24L01p::setDynamicPayloadLength(uint8_t pipe, bool newVal){
	switch (pipe){
		case (0x00):
				setRegisterBit(nRF24L01p_Registers_DYNPD, nRF24L01p_RegisterBits_DPL_P0, newVal);
				break;
		case (0x01):
				setRegisterBit(nRF24L01p_Registers_DYNPD, nRF24L01p_RegisterBits_DPL_P1, newVal);
				break;
		case (0x02):
				setRegisterBit(nRF24L01p_Registers_DYNPD, nRF24L01p_RegisterBits_DPL_P2, newVal);
				break;
		case (0x03):
				setRegisterBit(nRF24L01p_Registers_DYNPD, nRF24L01p_RegisterBits_DPL_P3, newVal);
				break;
		case (0x04):
				setRegisterBit(nRF24L01p_Registers_DYNPD, nRF24L01p_RegisterBits_DPL_P4, newVal);
				break;
		case (0x05):
				setRegisterBit(nRF24L01p_Registers_DYNPD, nRF24L01p_RegisterBits_DPL_P5, newVal);
				break;
	}
}
uint8_t nRF24L01p::getDynamicPayloadLength(void){
	uint8_t* tmp = new uint8_t[2];
	uint8_t* rec = new uint8_t[2];
	uint8_t returnVal;
	*tmp = nRF24L01p_Commands_R_RX_PL_WID;
	*(tmp+1) = 0x00;
	nRFObj->SPIObject->print(tmp, rec, 2);
	returnVal = *(rec+1);
	free(tmp);
	free(rec);
	return returnVal;
}
uint8_t nRF24L01p::getDynamicPayloadLength(uint8_t pipe){
	switch (pipe){
	case 0x00:
		return getRegister(nRF24L01p_Registers_RX_ADDR_P0);
		break;
	case 0x01:
		return getRegister(nRF24L01p_Registers_RX_ADDR_P1);
		break;
	case 0x02:
		return getRegister(nRF24L01p_Registers_RX_ADDR_P2);
		break;
	case 0x03:
		return getRegister(nRF24L01p_Registers_RX_ADDR_P3);
		break;
	case 0x04:
		return getRegister(nRF24L01p_Registers_RX_ADDR_P4);
		break;
	case 0x05:
		return getRegister(nRF24L01p_Registers_RX_ADDR_P5);
		break;
	}
	return 0x00;
}

void nRF24L01p::setAddressSize(uint8_t size){
	if(size == 3){
		nRFObj->addressSize = size;
		setRegister(nRF24L01p_Registers_Setup_AW, 0x01<<nRF24L01p_RegisterBits_AW);
	} else if (size == 4){
		nRFObj->addressSize = size;
		setRegister(nRF24L01p_Registers_Setup_AW, 0x02<<nRF24L01p_RegisterBits_AW);
	} else if (size == 5){
		nRFObj->addressSize = size;
		setRegister(nRF24L01p_Registers_Setup_AW, 0x03<<nRF24L01p_RegisterBits_AW);
	} else {
		nRFObj->addressSize = 5;
		setRegister(nRF24L01p_Registers_Setup_AW, 0x03<<nRF24L01p_RegisterBits_AW);
	}
}
uint8_t nRF24L01p::getAddressSize(void){
	uint8_t tmp = getRegister(nRF24L01p_Registers_Setup_AW) & 0x03;
	switch (tmp){
	case 0x01:
		return 3;
		break;
	case 0x02:
		return 4;
		break;
	case 0x03:
		return 5;
		break;
	}
	return 0;
}

void nRF24L01p::setTXAddress(uint8_t* buffer, uint8_t size){
    /* RX_ADDR_P0 must be set to the sending addr for auto ack to work. */

    setRXAddress(0, buffer, size);
    setRegister(nRF24L01p_Registers_TX_ADDR, buffer, size);
}

void nRF24L01p::getTXAddress(uint8_t* returnptr){
	uint8_t* tmp = new uint8_t[6];
	*tmp = getReceiveCommand(nRF24L01p_Registers_TX_ADDR);
	memset((void*)(tmp+1), 0, 5);
	nRFObj->SPIObject->print(tmp, returnptr, 6);
	free(tmp);
}

void nRF24L01p::setRXAddress(uint8_t* buffer, uint8_t size){
	setRXAddress(1, buffer, size);
}

void nRF24L01p::setRXAddress(uint8_t pipe, uint8_t* buffer, uint8_t size){
	nRF24L01p_Registers_t tmp = nRF24L01p_Registers_Config;
	if(pipe>5){
		return;
	}

	switch (pipe){
	case (0x00):
			tmp = nRF24L01p_Registers_RX_ADDR_P0;
			break;
	case (0x01):
			tmp = nRF24L01p_Registers_RX_ADDR_P1;
			break;
	case (0x02):
			tmp = nRF24L01p_Registers_RX_ADDR_P2;
			break;
	case (0x03):
			tmp = nRF24L01p_Registers_RX_ADDR_P3;
			break;
	case (0x04):
			tmp = nRF24L01p_Registers_RX_ADDR_P4;
			break;
	case (0x05):
			tmp = nRF24L01p_Registers_RX_ADDR_P5;
			break;
	}

	setCE(false);
		setRegister(tmp, buffer, size);
	setCE(true);
}
void nRF24L01p::getRXAddress(uint8_t* returnptr, uint8_t pipe){
	uint8_t* tmp = new uint8_t[6];
	if(pipe>5){
		return;
	}
	switch (pipe){
	case (0x00):
			*tmp = nRF24L01p_Registers_RX_ADDR_P0;
			break;
	case (0x01):
			*tmp = nRF24L01p_Registers_RX_ADDR_P1;
			break;
	case (0x02):
			*tmp = nRF24L01p_Registers_RX_ADDR_P2;
			break;
	case (0x03):
			*tmp = nRF24L01p_Registers_RX_ADDR_P3;
			break;
	case (0x04):
			*tmp = nRF24L01p_Registers_RX_ADDR_P4;
			break;
	case (0x05):
			*tmp = nRF24L01p_Registers_RX_ADDR_P5;
			break;
	}
	memset((void*)(tmp+1), 0, 5);
	nRFObj->SPIObject->print(tmp, returnptr, 6);
	free(tmp);
}

