Ribster/STM32-Projects/stm32lib for STM32F0/ECS0002 - STM32F051 stm32lib/src/nRF24L01p.cpp
void nRF24L01p::setEnableRXAddress(uint8_t pipe, bool newVal){
	switch (pipe){
		case (0x00):
				setRegisterBit(nRF24L01p_Registers_EN_RXAddr, nRF24L01p_RegisterBits_ERX_P0, newVal);
				break;
		case (0x01):
				setRegisterBit(nRF24L01p_Registers_EN_RXAddr, nRF24L01p_RegisterBits_ERX_P1, newVal);
				break;
		case (0x02):
				setRegisterBit(nRF24L01p_Registers_EN_RXAddr, nRF24L01p_RegisterBits_ERX_P2, newVal);
				break;
		case (0x03):
				setRegisterBit(nRF24L01p_Registers_EN_RXAddr, nRF24L01p_RegisterBits_ERX_P3, newVal);
				break;
		case (0x04):
				setRegisterBit(nRF24L01p_Registers_EN_RXAddr, nRF24L01p_RegisterBits_ERX_P4, newVal);
				break;
		case (0x05):
				setRegisterBit(nRF24L01p_Registers_EN_RXAddr, nRF24L01p_RegisterBits_ERX_P5, newVal);
				break;
	}
}

bool nRF24L01p::getEnableRXAddress(uint8_t pipe){
	switch (pipe){
		case (0x00):
				return getRegisterBit(nRF24L01p_Registers_EN_RXAddr, nRF24L01p_RegisterBits_ERX_P0);
				break;
		case (0x01):
				return getRegisterBit(nRF24L01p_Registers_EN_RXAddr, nRF24L01p_RegisterBits_ERX_P1);
				break;
		case (0x02):
				return getRegisterBit(nRF24L01p_Registers_EN_RXAddr, nRF24L01p_RegisterBits_ERX_P2);
				break;
		case (0x03):
				return getRegisterBit(nRF24L01p_Registers_EN_RXAddr, nRF24L01p_RegisterBits_ERX_P3);
				break;
		case (0x04):
				return getRegisterBit(nRF24L01p_Registers_EN_RXAddr, nRF24L01p_RegisterBits_ERX_P4);
				break;
		case (0x05):
				return getRegisterBit(nRF24L01p_Registers_EN_RXAddr, nRF24L01p_RegisterBits_ERX_P5);
				break;
	}
	return false;
}

void nRF24L01p::setEnableInterrupt(nRF24L01p_Interrupts_t interruptSelection, bool newVal){
	switch (interruptSelection){
		case (nRF24L01p_Interrupts_DataReady):
				setRegisterBit(nRF24L01p_Registers_Config, nRF24L01p_RegisterBits_Config_RX_DR, !newVal);
			break;
		case (nRF24L01p_Interrupts_DataSet):
				setRegisterBit(nRF24L01p_Registers_Config, nRF24L01p_RegisterBits_Config_TX_DS, !newVal);
			break;
		case (nRF24L01p_Interrupts_MaxRetransmission):
				setRegisterBit(nRF24L01p_Registers_Config, nRF24L01p_RegisterBits_Config_MAX_RT, !newVal);
			break;
	}
}

void nRF24L01p::setEnableDynamicAcknowledgement(bool newVal){
	setRegisterBit(nRF24L01p_Registers_FEATURE, nRF24L01p_RegisterBits_FEATURE_EN_DYN_ACK, newVal);
}
bool nRF24L01p::getEnableDynamicAcknowledgement(void){
	return getRegisterBit(nRF24L01p_Registers_FEATURE, nRF24L01p_RegisterBits_FEATURE_EN_DYN_ACK);
}

void nRF24L01p::setEnablePayloadAcknowledgement(bool newVal){
	setRegisterBit(nRF24L01p_Registers_FEATURE, nRF24L01p_RegisterBits_FEATURE_EN_ACK_PAY, newVal);
}
bool nRF24L01p::getEnablePayloadAcknowledgement(void){
	return getRegisterBit(nRF24L01p_Registers_FEATURE, nRF24L01p_RegisterBits_FEATURE_EN_ACK_PAY);
}

void nRF24L01p::setEnableDynamicPayloadLength(bool newVal){
	setRegisterBit(nRF24L01p_Registers_FEATURE, nRF24L01p_RegisterBits_FEATURE_EN_DPL, newVal);
}
bool nRF24L01p::getEnableDynamicPayloadLength(void){
	return getRegisterBit(nRF24L01p_Registers_FEATURE, nRF24L01p_RegisterBits_FEATURE_EN_DPL);
}

bool nRF24L01p::getInterruptStatus(nRF24L01p_Interrupts_t interruptSelection){
	switch (interruptSelection){
		case (nRF24L01p_Interrupts_DataReady):
				return getRegisterBit(nRF24L01p_Registers_Status, nRF24L01p_RegisterBits_Status_RX_DR);
			break;
		case (nRF24L01p_Interrupts_DataSet):
				return getRegisterBit(nRF24L01p_Registers_Status, nRF24L01p_RegisterBits_Status_TX_DS);
			break;
		case (nRF24L01p_Interrupts_MaxRetransmission):
				return getRegisterBit(nRF24L01p_Registers_Status, nRF24L01p_RegisterBits_Status_MAX_RT);
			break;
	}
	return false;
}
bool nRF24L01p::getInterruptConfig(nRF24L01p_Interrupts_t interruptSelection){
	switch (interruptSelection){
		case (nRF24L01p_Interrupts_DataReady):
				return !getRegisterBit(nRF24L01p_Registers_Config, nRF24L01p_RegisterBits_Config_RX_DR);
			break;
		case (nRF24L01p_Interrupts_DataSet):
				return !getRegisterBit(nRF24L01p_Registers_Config, nRF24L01p_RegisterBits_Config_TX_DS);
			break;
		case (nRF24L01p_Interrupts_MaxRetransmission):
				return !getRegisterBit(nRF24L01p_Registers_Config, nRF24L01p_RegisterBits_Config_MAX_RT);
			break;
	}
	return false;
}

void nRF24L01p::setInterruptClear(nRF24L01p_Interrupts_t interruptSelection){
	switch (interruptSelection){
		case (nRF24L01p_Interrupts_DataReady):
				setRegisterBit(nRF24L01p_Registers_Status, nRF24L01p_RegisterBits_Status_RX_DR, true);
			break;
		case (nRF24L01p_Interrupts_DataSet):
				setRegisterBit(nRF24L01p_Registers_Status, nRF24L01p_RegisterBits_Status_TX_DS, true);
			break;
		case (nRF24L01p_Interrupts_MaxRetransmission):
				setRegisterBit(nRF24L01p_Registers_Status, nRF24L01p_RegisterBits_Status_MAX_RT, true);
			break;
	}
}
void nRF24L01p::setInterruptClearAll(void){
	uint8_t tmp = getStatus();
	tmp |= ( (1<<nRF24L01p_RegisterBits_Status_RX_DR) | (1<<nRF24L01p_RegisterBits_Status_TX_DS) | (1<<nRF24L01p_RegisterBits_Status_MAX_RT) );

	setRegister(nRF24L01p_Registers_Status, tmp);
}

void nRF24L01p::setPowerUpRX(void){
	setFlushRX();
	setInterruptClearAll();
	uint8_t tmp = getRegister(nRF24L01p_Registers_Config);
	tmp |= ( (1<<nRF24L01p_RegisterBits_Config_PWR_UP) | (1<<nRF24L01p_RegisterBits_Config_PRIM_RX) );
	setCE(false);
	setRegister(nRF24L01p_Registers_Config, tmp);
	setCE(true);

}
void nRF24L01p::setPowerUpTX(void){
	setInterruptClearAll();
	uint8_t tmp = getRegister(nRF24L01p_Registers_Config);
	tmp |= (1<<nRF24L01p_RegisterBits_Config_PWR_UP);
	tmp &= ~(1<<nRF24L01p_RegisterBits_Config_PRIM_RX);
	setRegister(nRF24L01p_Registers_Config, tmp);
}
void nRF24L01p::setPowerDown(void){
	setCE(false);
	uint8_t tmp = getRegister(nRF24L01p_Registers_Config);
	tmp &= ~(1<<nRF24L01p_RegisterBits_Config_PWR_UP);
	tmp &= ~(1<<nRF24L01p_RegisterBits_Config_PRIM_RX);
	setRegister(nRF24L01p_Registers_Config, tmp);
}

bool nRF24L01p::getDataReady(void){
	return getRegisterBit(nRF24L01p_Registers_Status, nRF24L01p_RegisterBits_Status_RX_DR);
}
bool nRF24L01p::getMaxRetransmits(void){
	return getRegisterBit(nRF24L01p_Registers_Status, nRF24L01p_RegisterBits_Status_MAX_RT);
}
bool nRF24L01p::getTransmitDone(void){
	return getRegisterBit(nRF24L01p_Registers_Status, nRF24L01p_RegisterBits_Status_TX_DS);
}

bool nRF24L01p::getRXFIFOEmpty(void){
	return getRegisterBit(nRF24L01p_Registers_FIFO_Status, nRF24L01p_RegisterBits_FIFO_RX_Empty);
}
bool nRF24L01p::getRXFIFOFull(void){
	return getRegisterBit(nRF24L01p_Registers_FIFO_Status, nRF24L01p_RegisterBits_FIFO_RX_Full);
}
bool nRF24L01p::getTXFIFOEmpty(void){
	return getRegisterBit(nRF24L01p_Registers_FIFO_Status, nRF24L01p_RegisterBits_FIFO_TX_Empty);
}
bool nRF24L01p::getTXFIFOFull(void){
	return getRegisterBit(nRF24L01p_Registers_FIFO_Status, nRF24L01p_RegisterBits_FIFO_TX_Full);
}
uint8_t nRF24L01p::getPayloadWidth(void){
	return (getCommand(nRF24L01p_Commands_R_RX_PL_WID));
}
bool nRF24L01p::getIsSending(void){
	uint8_t tmp = getStatus();
	if ( (tmp & (1<<nRF24L01p_RegisterBits_Status_TX_DS)) && (tmp & (1<<nRF24L01p_RegisterBits_Status_MAX_RT)) ){
		return false;
	}
	return true;
}
uint8_t nRF24L01p::getStatus(void){
	return getRegister(nRF24L01p_Registers_Status);
}
nRF24L01p_Transmit_Status_t nRF24L01p::getLastMessageStatus(void){
	uint8_t tmp = getStatus();
	if( tmp & (1<<nRF24L01p_RegisterBits_Status_TX_DS) ){
		return nRF24L01p_Transmit_Status_Ok;
	} else if ( tmp & (1<<nRF24L01p_RegisterBits_Status_MAX_RT) ){
		return nRF24L01p_Transmit_Status_Lost;
	}
	return nRF24L01p_Transmit_Status_Sending;
}

