Ribster/STM32-Projects/stm32lib for STM32F0/ECS0002 - STM32F051 stm32lib/src/nRF24L01p.cpp
void nRF24L01p::setData(void){
	setData(nRFObj->nrfBuffer, nRFObj->payloadSize, nRF24L01p_Commands_W_TX_Payload);
}

void nRF24L01p::setData(uint8_t* buffer){
	setData(buffer, nRFObj->payloadSize, nRF24L01p_Commands_W_TX_Payload);
}

void nRF24L01p::setDataNoAck(void){
	setData(nRFObj->nrfBuffer, nRFObj->payloadSize, nRF24L01p_Commands_W_TX_Payload_No_Ack);
}

void nRF24L01p::setData(uint8_t* buffer, uint8_t size, nRF24L01p_Commands_t cmd){
	printregister(nRF24L01p_Registers_Status);
	setCE(false);

	setPowerUpTX();

	setFlushTX();

	setSS(false);
	nRFObj->SPIObject->printnoSS(cmd);
	nRFObj->SPIObject->printnoSS(buffer, size);
	setSS(true);

	setCE(true);
	printregister(nRF24L01p_Registers_Status);
	printregister(nRF24L01p_Registers_Status);
	printregister(nRF24L01p_Registers_Status);
	printregister(nRF24L01p_Registers_Status);
	printregister(nRF24L01p_Registers_Status);
	setPowerDown();
	setPowerUpRX();
}

void nRF24L01p::getData(uint8_t* buffer, uint8_t size){

	uint8_t* tmp = new uint8_t[size+1];
	uint8_t* rec = new uint8_t[size+1];
	*tmp = nRF24L01p_Commands_R_RX_Payload;
	memset((void*) (tmp+1), 0, size);

	nRFObj->SPIObject->print(tmp, rec, size+1);

	memcpy((void*) buffer, (rec+1), size);

	free(tmp);
	free(rec);
}

void nRF24L01p::setFlushTX(void){
	setCommand(nRF24L01p_Commands_Flush_TX);
}
void nRF24L01p::setFlushRX(void){
	setCommand(nRF24L01p_Commands_Flush_RX);
}

void nRF24L01p::printregister(nRF24L01p_Registers_t reg){
	printf("register 0x%X has value 0x%X \r\n", reg, getRegister(reg));
}

void nRF24L01p::interruptHandler(void){
	// STUB
}

void nRF24L01p::setCE(bool newVal){
	nRFObj->IOObject->setValue(nRFObj->pin_CE, newVal);
}
void nRF24L01p::setLED(bool newVal){
	nRFObj->IOObject->setValue(nRFObj->pin_LED, newVal);
}
void nRF24L01p::getIRQ(bool newVal){
	nRFObj->IOObject->setValue(nRFObj->pin_IRQ, newVal);
}
void nRF24L01p::setSS(bool newVal){
	nRFObj->IOObject->setValue(nRFObj->SPIStruct->pin_SS, newVal);
}

void nRF24L01p::setRegister(nRF24L01p_Registers_t registers, uint8_t newVal){
	uint8_t tmp[2] = {getSendCommand(registers),newVal};
	nRFObj->SPIObject->print(tmp, 2);
}
void nRF24L01p::setRegister(nRF24L01p_Registers_t registers, uint8_t* buffer, uint8_t size){
	uint8_t* tmp = new uint8_t[size+1];
	memcpy((void*)(tmp+1),(void*)buffer,size);
	*tmp = getSendCommand(registers);
	nRFObj->SPIObject->print(tmp, size+1);
	free(tmp);
}
uint8_t nRF24L01p::getRegister(nRF24L01p_Registers_t registers){
	uint8_t tmp[2] = {getReceiveCommand(registers),0xFF};
	uint8_t rec[2] = {0x00, 0x00};
	nRFObj->SPIObject->print(tmp, rec, 2);
	return rec[1];
}

void nRF24L01p::setRegisterBit(nRF24L01p_Registers_t registers, uint8_t bitloc, bool newVal){
	uint8_t tmp = getRegister(registers);
	if(newVal){
		tmp |= (1<<bitloc);
	} else {
		tmp &= ~(1<<bitloc);
	}
	nRFObj->SPIObject->print(tmp);
}
bool nRF24L01p::getRegisterBit(nRF24L01p_Registers_t registers, uint8_t bitloc){
	uint8_t tmp = getRegister(registers);
	if(tmp & (1<<bitloc)){
		return true;
	}
	return false;
}

void nRF24L01p::setCommand(nRF24L01p_Commands_t cmd){
	nRFObj->SPIObject->print(cmd);
}
uint8_t nRF24L01p::getCommand(nRF24L01p_Commands_t cmd){
	uint8_t* tmp = new uint8_t[2];
	uint8_t* rec = new uint8_t[2];
	uint8_t returnVal;
	*tmp = cmd;
	*(tmp+1) = 0x00;
	nRFObj->SPIObject->print(tmp, rec, 2);
	returnVal = *(rec+1);
	free(tmp);
	free(rec);
	return returnVal;
}

uint8_t nRF24L01p::getSendCommand(nRF24L01p_Registers_t registers){
	return ( registers & 0x1F ) | 0x20 ;
}
uint8_t nRF24L01p::getReceiveCommand(nRF24L01p_Registers_t registers){
	return ( registers & 0x1F );
}

void nRF24L01p::setAllocBuffer(uint8_t newSize){
	if( newSize != nRFObj->payloadSize){
		free(nRFObj->nrfBuffer);
		nRFObj->nrfBuffer = new uint8_t[newSize];
		nRFObj->payloadSize = newSize;
	}
}
}
